terraform plan
```tf
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dns_managed_zone.private_zones["lab-d-121431-private"] will be created
  + resource "google_dns_managed_zone" "private_zones" {
      + creation_time    = (known after apply)
      + description      = "Private DNS zone for lab-d-121431.cg.tentwentyone.io."
      + dns_name         = "lab-d-121431-private"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "lab-d-121431.cg.tentwentyone.io."
      + name_servers     = (known after apply)
      + project          = "lab-d-121431"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "private"

      + cloud_logging_config (known after apply)

      + dnssec_config (known after apply)
    }

  # google_dns_managed_zone.private_zones["wshop01-p-private"] will be created
  + resource "google_dns_managed_zone" "private_zones" {
      + creation_time    = (known after apply)
      + description      = "Private DNS zone for wshop01-p.cg.tentwentyone.io."
      + dns_name         = "wshop01-p-private"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "wshop01-p.cg.tentwentyone.io."
      + name_servers     = (known after apply)
      + project          = "wshop01-p-154457"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "private"

      + cloud_logging_config (known after apply)

      + dnssec_config (known after apply)
    }

  # google_dns_managed_zone.public_zones["lab-d-121431-public"] will be created
  + resource "google_dns_managed_zone" "public_zones" {
      + creation_time    = (known after apply)
      + description      = "Public DNS zone for lab-d-121431.cg.tentwentyone.io."
      + dns_name         = "lab-d-121431-public"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "lab-d-121431.cg.tentwentyone.io."
      + name_servers     = (known after apply)
      + project          = "lab-d-121431"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "public"

      + cloud_logging_config (known after apply)

      + dnssec_config (known after apply)
    }

  # google_dns_managed_zone.public_zones["wshop01-p-public"] will be created
  + resource "google_dns_managed_zone" "public_zones" {
      + creation_time    = (known after apply)
      + description      = "Public DNS zone for wshop01-p.cg.tentwentyone.io."
      + dns_name         = "wshop01-p-public"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "wshop01-p.cg.tentwentyone.io."
      + name_servers     = (known after apply)
      + project          = "wshop01-p-154457"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "public"

      + cloud_logging_config (known after apply)

      + dnssec_config (known after apply)
    }

  # google_dns_record_set.parent_ns["lab-d-121431-public"] will be created
  + resource "google_dns_record_set" "parent_ns" {
      + id           = (known after apply)
      + managed_zone = "cg-tentwentyone-io"
      + name         = "lab-d-121431.cg.tentwentyone.io."
      + project      = "ten21-prod-net-landing-0"
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "NS"
    }

  # google_dns_record_set.parent_ns["wshop01-p-public"] will be created
  + resource "google_dns_record_set" "parent_ns" {
      + id           = (known after apply)
      + managed_zone = "cg-tentwentyone-io"
      + name         = "wshop01-p.cg.tentwentyone.io."
      + project      = "ten21-prod-net-landing-0"
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "NS"
    }

  # google_storage_bucket_object.tfvars["wshop01-p-154457-rw"] will be created
  + resource "google_storage_bucket_object" "tfvars" {
      + bucket         = "ten21-prod-iac-core-outputs-0"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "providers/2-project-factory/wshop01-p-154457-rw-providers.tf"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + storage_class  = (known after apply)
    }

  # local_file.providers["wshop01-p-154457-rw"] will be created
  + resource "local_file" "providers" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0644"
      + filename             = "../fast-config/providers/2-project-factory/wshop01-p-154457-rw-providers.tf"
      + id                   = (known after apply)
    }

  # module.projects.module.automation-bucket["wshop01-p-154457"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "ten21-wshop01-p-154457-tf-state"
      + project                     = "ten21-prod-iac-core-0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.projects.module.automation-bucket["wshop01-p-154457"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectCreator"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-wshop01-p-154457-tf-state"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectCreator"
    }

  # module.projects.module.automation-bucket["wshop01-p-154457"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-wshop01-p-154457-tf-state"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectViewer"
    }

  # module.projects.module.automation-service-accounts["wshop01-p-154457/rw"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-wshop01-p-154457-rw"
      + description  = "Read/write automation sa for team cloudops."
      + disabled     = false
      + display_name = "Service account rw for wshop01-p-154457."
      + email        = "ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.projects.module.automation-service-accounts["wshop01-p-154457/rw"].google_service_account_iam_binding.bindings["binding"] will be created
  + resource "google_service_account_iam_binding" "bindings" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "group:tto-workshop-iac-writers@tentwentyone.io",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.projects.module.projects["wshop01-p-154457"].google_essential_contacts_contact.contact["gcp.billing.tentwentyone@tentwentyone.io"] will be created
  + resource "google_essential_contacts_contact" "contact" {
      + email                               = "gcp.billing.tentwentyone@tentwentyone.io"
      + id                                  = (known after apply)
      + language_tag                        = "en"
      + name                                = (known after apply)
      + notification_category_subscriptions = [
          + "BILLING",
        ]
      + parent                              = "projects/ten21-wshop01-p-154457"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "01C8D5-E4EA95-F2D624"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "gcp-cloudops"
        }
      + folder_id           = "51867431258"
      + id                  = (known after apply)
      + labels              = {
          + "team" = "gcp-cloudops"
        }
      + name                = "ten21-wshop01-p-154457"
      + number              = (known after apply)
      + project_id          = "ten21-wshop01-p-154457"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "gcp-cloudops"
        }
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["stackdriver.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "stackdriver.googleapis.com"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_compute_shared_vpc_service_project.shared_vpc_service[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_service" {
      + host_project    = "ten21-prod-net-spoke-0"
      + id              = (known after apply)
      + service_project = "ten21-wshop01-p-154457"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_project_iam_binding.authoritative["roles/resourcemanager.projectIamAdmin"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:tto-workshop-admins@tentwentyone.io",
        ]
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_project_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:tto-workshop-admins@tentwentyone.io",
          + "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/viewer"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_project_iam_member.shared_vpc_host_iam["group:gcp-devops@tentwentyone.io"] will be created
  + resource "google_project_iam_member" "shared_vpc_host_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-devops@tentwentyone.io"
      + project = "ten21-prod-net-spoke-0"
      + role    = "roles/compute.networkUser"
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```